// Норма

// 1. Запитай ім’я користувача та виведи у відповідь “Привіт, *ім’я*”;
const userName = prompt("Як тебе звати?", "Анонім");

alert(`Привіт, ${userName}!`);

// 2. Запитай рік народження користувача, порахуй його/її вік і виведи результат. Поточний рік вкажи в коді як константу;
const currentYear = 2023;
const userBirthYear = prompt("Bведи свій рік народження");
const userAge = currentYear - userBirthYear;
alert(`Тобі ${userAge} років!`);

// 3. Запитай у користувача довжину сторони квадрату і виведи периметр цього квадрата
const squareSide = prompt("BВведи довжину сторони квадрату");
const perimeter = squareSide * 4;
alert(`Периметр квадрату складає ${userAge} см!`);

// Максимум

// Запитай у користувача радіус кола і виведи площу такої окружності.(Sкола= 3,14*r2 )

const radius = prompt("Bведи довжину радіуса кола");
const square = Math.PI * radius * radius;
alert(`Плoща кола складає ${square} см2!`);

// Запитай у користувача відстань в кілометрах між двома містами і за скільки годин він хоче дістатися. Порахуй швидкість, з якою необхідно рухатися, щоб встигнути вчасно. (v = S : t)

const distance = prompt("відстань в кілометрах між двома містами");
const time = prompt("За скільки годин хочеш дістатися до місця призначення?");
const speed = distance / time;
alert(`Тобі потрібно їхати зі швидкістю ${speed} км на год!`);

// Реалізуй конвертор валют. Користувач вводить долари, програма переводить їх в євро. Курс валют зберігається в константі.

const currancyRate = 0.9;
const dollars = prompt("Скільки баксів хочеш поміняти?");
const euro = currancyRate * dollars;

alert(`За  ${dollars} баксів ти отримаєш  ${euro} євриків `);
