

// Мінімум

// Запитай у користувача його вік і визначи, ким він є: дитиною (0-11), підлітком (12-17), дорослим (18_59) або пенсіонером (60 ...), передбач можливість введення невірних даних.


const age = parseInt(prompt('Введіть свій вік:'));

if (isNaN(age)) {
  alert('Ви ввели некоректне значення для віку.');
} else {
  if (age < 0) {
    alert('Ви ще не народилися :)');
  } else if (age <= 11) {
    alert('Ви є дитиною.');
  } else if (age <= 17) {
    alert('Ви є підлітком.');
  } else if (age <= 59) {
    alert('Ви є дорослим.');
  } else if (age <= 120) {
    alert('Ви є пенсіонером.');
  } else {
    alert('Ви довгожитель!!!');
  }
}


// Запитай у користувача число від 0 до 9 і виведи йому спецсимвол, який розташований на цій клавіші (1 !, 2 @, 3 # і т. д).

const number = parseInt(prompt('Введіть число від 0 до 9:'));

if (isNaN(number) || number < 0 || number > 9) {
  alert('Ви ввели некоректне число.');
} else {
  switch (number) {
    case 0:
      alert('Спецсимвол на клавіші 0 - )');
      break;
    case 1:
      alert('Спецсимвол на клавіші 1 - !');
      break;
    case 2:
      alert('Спецсимвол на клавіші 2 - @');
      break;
    case 3:
      alert('Спецсимвол на клавіші 3 - #');
      break;
    case 4:
      alert('Спецсимвол на клавіші 4 - $');
      break;
    case 5:
      alert('Спецсимвол на клавіші 5 - %');
      break;
    case 6:
      alert('Спецсимвол на клавіші 6 - ^');
      break;
    case 7:
      alert('Спецсимвол на клавіші 7 - &');
      break;
    case 8:
      alert('Спецсимвол на клавіші 8 - *');
      break;
    case 9:
      alert('Спецсимвол на клавіші 9 - (');
      break;
  }
}


// Підрахуй суму всіх чисел в заданому користувачем діапазоні.
const num1 = parseInt(prompt('Введіть перше число діапазону: '));
const num2 = parseInt(prompt('Введіть друге число діапазону: '));
if(isNaN(num1) || isNaN(num2)) {
  alert('Ви ввели некоректні дані.');
  } else {
    let sum = 0;
for(let index = num1; index <= num2; index+=1){
sum+=index;
}
alert(`Сума всіх чисел в діапазоні від ${num1} до ${num2} дорівнює ${sum}.`);
  }



// Запитай у користувача 2 числа і знайди найбільший спільний дільник.

const num3 = parseInt(prompt('Введіть перше число: '));
const num4 = parseInt(prompt('Введіть друге число: '));

function findGCD(num3, num4) {

  while (num4 !== 0) {
    let temp = num4;
    num4 = num3 % num4;
    num3 = temp;
  }
  return num3;
}

const gcd = findGCD(num3, num4);
alert(`Найбільший спільний дільник ${num3} та ${num4} дорівнює ${gcd}.`);

// Запитай у користувача число і виведи всі дільники цього числа.
const numberX = parseInt(prompt('Введіть число:'));

if (isNaN(numberX)) {
 alert('Ви ввели некоректні дані.');
} else {
  const divisors = [];
  for (let item = 1; item <= numberX; item+=1) {
    if (numberX % item === 0) {
      divisors.push(item);
    }
  }
 alert(`Дільники числа ${numberX}: ${divisors.join(', ')}`);
}

// Норма

// Запитай у користувача п’ятирозрядне число і визначи, чи є воно паліндромом.


// Запитай у користувача суму покупки і виведи суму до оплати зі знижкою:
// від 200 до 300 - знижка буде 3%; 
// від 300 до 500 - 5%;
// від 500 і вище - 7%.


// Запитай у користувача 10 чисел і порахуй, скільки він ввів додатніх, від’ємних і нулів. При цьому також порахуй, скільки з них парних і непарних. Виведи статистику на екран. Враховуй, що достатньо однієї змінної (не 10) для введення чисел користувачем.

// Зацикли відображення днів тижня таким чином: «День тижня. Хочеш побачити наступний день? » і так до тих пір, поки користувач натискає OK.






// Максимум

// Гра «Вгадай число». Запропонуй користувачеві загадати число від 0 до 100 і відгадай його наступним способом: кожну ітерацію циклу діли діапазон чисел навпіл, записуй результат в N і питай у користувача «Ваше число> N, <N або == N?». Залежно від того що вказав користувач, зменшуй діапазон. Початковий діапазон від 0 до 100, поділи навпіл і отримай 50. Якщо користувач вказав, що його число> 50, то зміни діапазон на від 50 до 100. І так до тих пір, поки користувач не вибере == N (буде корисним почитати про алгоритм: "бінарний пошук").

{/* Виведи таблицю множення для всіх чисел від 2 до 9. Кожне число необхідно помножити на числа від 1 до 10. */}

{/* Запитай дату (день, місяць, рік) і виведи наступну за нею дату. Враховуй можливість переходу на наступний місяць, рік, а також високосний рік. */}